rtzaudio/STC1200_TivaTM4C1294NCPDT/tcpHooks.c
    GateMutex_leave(GateMutex_handle(&s_gate), key);

    return i;
}

//*****************************************************************************
// STREAMS TRANSPORT STATE CHANGE INFO TO CLIENT. THERE CAN BE MULTIPLE
// STREAMING STATE WORKER THREADS RUNNING.
//*****************************************************************************

Void tcpStateWorker(UArg arg0, UArg arg1)
{
    int     clientfd = (int)arg0;
    int     fd;
    int     bytesSent;
    int     bytesToSend;
    size_t  i;
    bool    connected = true;
    STC_STATE_MSG stateMsg;

    System_printf("tcpStateWorker: CONNECT clientfd = 0x%x\n", clientfd);
    System_flush();

    ClientAdd(clientfd);

    /* Set initially to send tape time update packet
     * since the client just connected.
     */
    Event_post(g_eventTransport, Event_Id_00);

    const UInt EVENT_MASK = Event_Id_00|Event_Id_01|Event_Id_02|Event_Id_03|Event_Id_04;

    while (connected)
    {
        /* Wait for a change event to update client status
         *
         * Event_Id_00     tape position change
         * Event_Id_01     transport switch or LED state changed
         * Event_Id_02     DRC remote switch state changed
         * Event_Id_03     track assign state changed
         * Event_Id_04     tape roller index pulse detected
         */
        UInt events = Event_pend(g_eventTransport, Event_Id_NONE, EVENT_MASK, 2500);

        /* Get the tape time member values */
        PositionToTapeTime(g_sys.tapePosition, &stateMsg.tapeTime);

        uint32_t transportMode = g_sys.transportMode;

        /* Test for search mode active */
        if (g_sys.searching)
            transportMode |= STC_M_SEARCH;
        /* Test for loop mode active */
        if (g_sys.autoLoop)
            transportMode |= STC_M_LOOP;
        /* Test for auto-punch mode */
        if (g_sys.autoPunch)
            transportMode |= STC_M_PUNCH;

        int8_t tapedir = 0;

        if (g_sys.tapeTach > 0.0f)
            tapedir = (g_sys.tapeDirection > 0) ?  1 : -1;

        uint32_t maskTransport = g_sys.ledMaskTransport;

        /* Simulate tape lifter button LED active flag */
        if (g_sys.transportMode & M_LIFTER)
            maskTransport |= STC_L_LDEF;

        /* Determine hardware status bit flags */
        uint8_t hardwareFlags = 0;

        /* SMPTE controller found */
        if (g_sys.smpteFound)
            hardwareFlags |= STC_HF_SMPTE;
        /* DCS channel switcher found */
        if (g_sys.dcsFound)
            hardwareFlags |= STC_HF_DCS;
        /* External RTC clock found */
        if (g_sys.rtcFound)
            hardwareFlags |= STC_HF_RTC;

        stateMsg.length             = sizeof(STC_STATE_MSG);
        stateMsg.errorCount         = g_sys.qei_error_cnt;
        stateMsg.ledMaskButton      = g_sys.ledMaskRemote;
        stateMsg.ledMaskTransport   = maskTransport;
        stateMsg.tapePosition       = g_sys.tapePosition;
        stateMsg.tapeVelocity       = (uint32_t)g_sys.tapeTach;
        stateMsg.transportMode      = (uint16_t)transportMode;
        stateMsg.tapeDirection      = tapedir;
        stateMsg.tapeSpeed          = (uint8_t)g_sys.tapeSpeed;
        stateMsg.tapeSize           = (uint8_t)2;
        stateMsg.searchProgress     = (uint8_t)g_sys.searchProgress;
        stateMsg.searching          = g_sys.searching;
        stateMsg.monitorFlags       = (uint8_t)g_sys.standbyMonitor;
        stateMsg.trackCount         = (uint8_t)g_sys.trackCount;
        stateMsg.hardwareFlags      = hardwareFlags;
        stateMsg.smpteMode          = (uint8_t)g_sys.smpteMode;
        stateMsg.smpteFPS           = (uint8_t)g_sys.cfgSTC.smpteFPS;

        stateMsg.dateTime.date      = g_sys.timeDate.date;
        stateMsg.dateTime.hour      = g_sys.timeDate.hour;
        stateMsg.dateTime.min       = g_sys.timeDate.min;
        stateMsg.dateTime.month     = g_sys.timeDate.month;
        stateMsg.dateTime.sec       = g_sys.timeDate.sec;
        stateMsg.dateTime.weekday   = g_sys.timeDate.weekday;
        stateMsg.dateTime.year      = g_sys.timeDate.year;

        memcpy(&stateMsg.tapeTime, &g_sys.tapeTime, sizeof(TAPETIME));
        memcpy(&stateMsg.smpteTime, &g_sys.smpteTime, sizeof(TAPETIME));

        /* Zero out the reserved space bytes */
        memset(stateMsg.reserved, 0, sizeof(stateMsg.reserved));

        /* Copy the track state info */
        for (i=0; i < STC_MAX_TRACKS; i++)
            stateMsg.trackState[i] = g_sys.trackState[i];

        /* Copy the cue memory status bits */
        for (i=0; i < STC_MAX_CUE_POINTS; i++)
            stateMsg.cueState[i] = (uint8_t)g_sys.cuePoint[i].flags;

        /* Send state message buffer to all clients */

        for(i=0; i < NUMTCPWORKERS; i++)
        {
            fd = s_clientfd[i];

            if (fd != 0)
            {
                bytesToSend = sizeof(STC_STATE_MSG);

                if ((bytesSent = WriteData(fd, &stateMsg, bytesToSend, 0)) <= 0)
                {
                    ClientDelete(fd);

                    if (fd == clientfd)
                    {
                        connected = false;
                        break;
                    }
                }
            }
        }

        (void)bytesSent;
    }

    System_printf("tcpStateWorker DISCONNECT clientfd = 0x%x\n", clientfd);
    System_flush();

    close(clientfd);
}

//*****************************************************************************
// LISTENER CREATES COMMAND/RESPONSE WORKER TASK FOR NEW CONNECTIONS.
//*****************************************************************************

Void tcpCommandHandler(UArg arg0, UArg arg1)
{
    int                status;
    int                clientfd;
    int                server;
    struct sockaddr_in localAddr;
    struct sockaddr_in clientAddr;
    int                optval;
    int                optlen = sizeof(optval);
    socklen_t          addrlen = sizeof(clientAddr);
    Task_Handle        taskHandle;
    Task_Params        taskParams;
    Error_Block        eb;

    server = socket(AF_INET, SOCK_STREAM, IPPROTO_TCP);

    if (server == -1)
    {
        System_printf("Error: socket not created.\n");
        goto shutdown;
    }

    memset(&localAddr, 0, sizeof(localAddr));

