rtzaudio/STC1200_TivaTM4C1294NCPDT/tcpHooks.c
    localAddr.sin_family      = AF_INET;
    localAddr.sin_addr.s_addr = htonl(INADDR_ANY);
    localAddr.sin_port        = htons(arg0);

    status = bind(server, (struct sockaddr *)&localAddr, sizeof(localAddr));

    if (status == -1)
    {
        System_printf("Error: bind failed.\n");
        goto shutdown;
    }

    status = listen(server, NUMTCPWORKERS);

    if (status == -1)
    {
        System_printf("Error: listen failed.\n");
        goto shutdown;
    }

    optval = 100;

    if (setsockopt(server, SOL_SOCKET, SO_KEEPALIVE, &optval, optlen) < 0)
    {
        System_printf("Error: setsockopt failed\n");
        goto shutdown;
    }

    while ((clientfd = accept(server, (struct sockaddr *)&clientAddr, &addrlen)) != -1)
    {
        //System_printf("tcpStateHandler: Creating thread clientfd = %d\n", clientfd);
        //System_flush();

        /* Init the Error_Block */
        Error_init(&eb);

        /* Initialize the defaults and set the parameters. */
        Task_Params_init(&taskParams);
        taskParams.arg0      = (UArg)clientfd;
        taskParams.stackSize = 1280;
        taskParams.priority  = 5;

        taskHandle = Task_create((Task_FuncPtr)tcpCommandWorker, &taskParams, &eb);

        if (taskHandle == NULL)
        {
            //System_printf("Error: Failed to create new Task\n");
            //System_flush();
            close(clientfd);
        }

        /* addrlen is a value-result param, must reset for next accept call */
        addrlen = sizeof(clientAddr);
    }

    System_printf("Exiting TCP command listener task\n");
    System_flush();

shutdown:

    System_flush();

    if (server > 0)
    {
        close(server);
    }
}

//*****************************************************************************
// HANDLES COMMAND/RESPONSE REQUESTS FROM CLIENT. THERE CAN BE MULTIPLE
// COMMAND HANDLER WORKER THREADS RUNNING.
//*****************************************************************************

#define RXBUF_SIZE  512

Void tcpCommandWorker(UArg arg0, UArg arg1)
{
    bool        connected = true;
    bool        notify;
    int         clientfd = (int)arg0;
    int         bytesSent;
    int         bytesRcvd;
    uint16_t    status;
    uint8_t*    buf;
    Error_Block eb;
    STC_COMMAND_HDR* hdr;

    Error_init(&eb);

    if ((buf = Memory_alloc(NULL, RXBUF_SIZE, NULL, &eb)) == NULL)
    {
        System_printf("tcpCommandWorker: OUT OF MEMORY 0x%x\n", clientfd);
        System_flush();
        return;
    }

    System_printf("tcpCommandWorker: CONNECT clientfd = 0x%x\n", clientfd);
    System_flush();

    while (connected)
    {
        /* Attempt to read a message header */
        bytesRcvd = ReadData(clientfd, buf, sizeof(STC_COMMAND_HDR), 0);

        if (bytesRcvd <= 0)
        {
            System_printf("Error: TCP read error %d.\n", bytesRcvd);
            System_flush();
            connected = FALSE;
            break;
        }

        /* First part of message is always the header struct data */
        hdr = (STC_COMMAND_HDR*)buf;

        /* Make sure our buffer can hold the message */
        if (hdr->length >= RXBUF_SIZE)
        {
            System_printf("Error: buffer size too small to handle %d bytes.\n", hdr->length);
            System_flush();
            continue;
        }

        /* Attempt to read the rest of the message following the header */
        bytesRcvd = ReadData(
                clientfd,
                buf + sizeof(STC_COMMAND_HDR),
                hdr->length - sizeof(STC_COMMAND_HDR),
                0);

        if (bytesRcvd <= 0)
        {
            System_printf("Error: TCP read error %d.\n", bytesRcvd);
            System_flush();
            connected = FALSE;
            break;
        }

        /*
         * Determine which command to process from the client
         */

        notify = false;

        switch(hdr->command)
        {
        case STC_CMD_VERSION_GET:
            status = HandleVersionGet(clientfd, (STC_COMMAND_VERSION_GET*)buf);
            break;

        case STC_CMD_STOP:
            status = HandleStop(clientfd, (STC_COMMAND_STOP*)buf);
            break;

        case STC_CMD_PLAY:
            status = HandlePlay(clientfd, (STC_COMMAND_PLAY*)buf);
            break;

        case STC_CMD_REW:
            status = HandleRew(clientfd, (STC_COMMAND_REW*)buf);
            break;

        case STC_CMD_FWD:
            status = HandleFwd(clientfd, (STC_COMMAND_FWD*)buf);
            break;

        case STC_CMD_LIFTER:
            status = HandleLifter(clientfd, (STC_COMMAND_LIFTER*)buf);
            break;

        case STC_CMD_LOCATE:
            status = HandleLocate(clientfd, (STC_COMMAND_LOCATE*)buf);
            break;

        case STC_CMD_LOCATE_AUTO_LOOP:
            status = HandleLocateAutoLoop(clientfd, (STC_COMMAND_LOCATE_AUTO_LOOP*)buf);
            break;

        case STC_CMD_LOCATE_MODE_SET:
            status = HandleLocateModeSet(clientfd, (STC_COMMAND_LOCATE_MODE_SET*)buf);
            break;

        case STC_CMD_AUTO_PUNCH_SET:
            status = HandleAutoPunchSet(clientfd, (STC_COMMAND_AUTO_PUNCH_SET*)buf);
            notify = TRUE;
            break;

        case STC_CMD_AUTO_PUNCH_GET:
            status = HandleAutoPunchGet(clientfd, (STC_COMMAND_AUTO_PUNCH_GET*)buf);
            break;

        case STC_CMD_CUEPOINT_CLEAR:
            status = HandleCuePointClear(clientfd, (STC_COMMAND_CUEPOINT_CLEAR*)buf);
            notify = true;
            break;

        case STC_CMD_CUEPOINT_STORE:
            status = HandleCuePointStore(clientfd, (STC_COMMAND_CUEPOINT_STORE*)buf);
            notify = true;
            break;

        case STC_CMD_CUEPOINT_SET:
            status = HandleCuePointSet(clientfd, (STC_COMMAND_CUEPOINT_SET*)buf);
            notify = true;
            break;

        case STC_CMD_CUEPOINT_GET:
            status = HandleCuePointGet(clientfd, (STC_COMMAND_CUEPOINT_GET*)buf);
            break;

        case STC_CMD_TRACK_TOGGLE_ALL:
            status = HandleTrackToggleAll(clientfd, (STC_COMMAND_TRACK_TOGGLE_ALL*)buf);
            notify = true;
            break;

