rtzaudio/STC1200_TivaTM4C1294NCPDT/tcpHooks.c
        case STC_CMD_TRACK_SET_STATE:
            status = HandleTrackSetState(clientfd, (STC_COMMAND_TRACK_SET_STATE*)buf);
            notify = true;
            break;

        case STC_CMD_TRACK_GET_STATE:
            status = HandleTrackGetState(clientfd, (STC_COMMAND_TRACK_GET_STATE*)buf);
            break;

        case STC_CMD_TRACK_MASK_ALL:
            status = HandleTrackMaskAll(clientfd, (STC_COMMAND_TRACK_MASK_ALL*)buf);
            notify = true;
            break;

        case STC_CMD_TRACK_MODE_ALL:
            status = HandleTrackModeAll(clientfd, (STC_COMMAND_TRACK_MODE_ALL*)buf);
            notify = true;
            break;

        case STC_CMD_ZERO_RESET:
            status = HandleZeroReset(clientfd, (STC_COMMAND_ZERO_RESET*)buf);
            notify = true;
            break;

        case STC_CMD_CANCEL:
            status = HandleCancel(clientfd, (STC_COMMAND_CANCEL*)buf);
            notify = true;
            break;

        case STC_CMD_TAPE_SPEED_SET:
            status = HandleTapeSpeedSet(clientfd, (STC_COMMAND_TAPE_SPEED_SET*)buf);
            notify = true;
            break;

        case STC_CMD_CONFIG_EPROM:
            status = HandleConfigEPROM(clientfd, (STC_COMMAND_CONFIG_EPROM*)buf);
            notify = true;
            break;

        case STC_CMD_MONITOR:
            status = HandleMonitor(clientfd, (STC_COMMAND_MONITOR*)buf);
            notify = true;
            break;

        case STC_CMD_TRACK_GET_COUNT:
            status = HandleTrackGetCount(clientfd, (STC_COMMAND_TRACK_GET_COUNT*)buf);
            break;

        case STC_CMD_MACHINE_CONFIG:
            status = HandleMachineConfig(clientfd, (STC_COMMAND_MACHINE_CONFIG*)buf);
            notify = true;
            break;

        case STC_CMD_MACHINE_CONFIG_GET:
            status = HandleMachineConfigGet(clientfd, (STC_COMMAND_MACHINE_CONFIG_GET*)buf);
            break;

        case STC_CMD_MACHINE_CONFIG_SET:
            status = HandleMachineConfigSet(clientfd, (STC_COMMAND_MACHINE_CONFIG_SET*)buf);
            notify = true;
            break;

        case STC_CMD_RTC_TIMEDATE_GET:
            status = HandleRTCTimeDateGet(clientfd, (STC_COMMAND_RTC_TIMEDATE_GET*)buf);
            break;

        case STC_CMD_RTC_TIMEDATE_SET:
            status = HandleRTCTimeDateSet(clientfd, (STC_COMMAND_RTC_TIMEDATE_SET*)buf);
            notify = true;
            break;

        case STC_CMD_MACADDR_GET:
            status = HandleMACAddrGet(clientfd, (STC_COMMAND_MACADDR_GET*)buf);
            break;

        case STC_CMD_SMPTE_ENCODER_CTRL:
            status = HandleSMPTEEncoderCtrl(clientfd, (STC_COMMAND_SMPTE_ENCODER_CTRL*)buf);
            notify = true;
            break;

        case STC_CMD_SMPTE_TIME_SET:
            status = HandleSMPTETimeSet(clientfd, (STC_COMMAND_SMPTE_TIME_SET*)buf);
            notify = true;
            break;

        default:
            break;
        }

        /* Send the response packet */

        bytesSent =  WriteData(clientfd, buf, hdr->length, 0);

        if (bytesSent <= 0)
        {
            System_printf("Error: TCP write error %d.\n", bytesSent);
            System_flush();
            connected = false;
            break;
        }

        /* Refresh transport state change to DRC1200 wired remote */
        if (notify)
            Event_post(g_eventTransport, Event_Id_03);

        (void)status;
    }

    /* Close the TCP handle */
    close(clientfd);

    /* Free rx buffer memory allocated */
    Memory_free(NULL, buf, RXBUF_SIZE);

    /* Debugger Message */
    System_printf("tcpCommandWorker DISCONNECT clientfd = 0x%x\n", clientfd);
    System_flush();
}

//*****************************************************************************
// COMMAND MESSAGE HANDLERS
//*****************************************************************************

uint16_t HandleVersionGet(int fd, STC_COMMAND_VERSION_GET* cmd)
{
#if 0
    int rc;
    uint32_t dtc_version;
    uint32_t dtc_build;

    /* Make an attempt to get the DTC version. If it's not there it will
     * timeout with an error and we just set the DTC version to zero.
     */
    rc = IPCToDTC_VersionGet(g_sys.ipcToDTC, &dtc_version, &dtc_build, NULL);

    if (rc != IPC_ERR_SUCCESS)
    {
        dtc_version = dtc_build = 0;
    }
#endif

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_VERSION_GET);
    cmd->hdr.index  = 0;
    cmd->hdr.status = (uint16_t)0;

    /* Reply Message Data */
    cmd->version_stc = MAKEREV(FIRMWARE_VER, FIRMWARE_REV);
    cmd->version_dtc = g_sys.dtcVersion;

    /* Copy the MAC address */
    memcpy(&(cmd->macaddr), &g_sys.ui8MAC, 6);
    /* Copy the STC serial number */
    memcpy(&(cmd->sernum_stc), &g_sys.ui8SerialNumberSTC, 16);
    /* Copy the DTC serial number*/
    memcpy(&(cmd->sernum_dtc), &g_sys.ui8SerialNumberDTC, 16);

    return 0;
}


uint16_t HandleStop(int fd, STC_COMMAND_STOP* cmd)
{
    /* Cancel an locate in progress */
    if (IsLocating())
        LocateCancel();

    /* Send STOP button press */
    Transport_PostButtonPress(S_STOP);

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_STOP);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleRew(int fd, STC_COMMAND_REW* cmd)
{
    uint32_t mask = S_REW;

    /* param1: flags STC_M_LIBWIND
     * param2: not used, zero
     */
    if (IsLocating())
        LocateCancel();

    /* simulate REC+FWD for lib wind mode */
    if (cmd->arg.param1.U & STC_M_LIBWIND)
        mask |= S_REC;

    Transport_PostButtonPress(mask);
    //Transport_Rew(0, msg.param1);

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_REW);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


