rtzaudio/STC1200_TivaTM4C1294NCPDT/tcpHooks.c
    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleMonitor(int fd, STC_COMMAND_MONITOR* cmd)
{
    /* Enable standby monitor mode for all tracks */
    g_sys.standbyMonitor = (cmd->arg.param1.U) ? true : false;

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_MONITOR);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleTrackGetCount(int fd, STC_COMMAND_TRACK_GET_COUNT* cmd)
{
    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_TRACK_GET_COUNT);
    cmd->hdr.index  = 0;
    cmd->hdr.status = 0;

    /* Reply Message Data */
    cmd->arg.param1.U = g_sys.trackCount;
    cmd->arg.param2.U = g_sys.dcsFound;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleMachineConfig(int fd, STC_COMMAND_MACHINE_CONFIG* cmd)
{
    int rc;

    /* This allows the STC to tell the DTC to load, store or
     * reset it configuration parameters to/from EPROM
     */
    switch(cmd->arg.param1.U)
    {
    case 0:
        // load the STC config data
        ConfigLoad(1);
        /* load DTC config */
        rc = IPCToDTC_ConfigEPROM(g_sys.ipcToDTC, 0);
        break;

    case 1:
        // save the STC config data
        ConfigSave(1);
        // save DTC config
        rc = IPCToDTC_ConfigEPROM(g_sys.ipcToDTC, 1);
        break;

    case 2:         /* reset DTC config */
        // reset STC config data to defaults
        ConfigReset(1);
        // reset DTC config data to defaults
        rc = IPCToDTC_ConfigEPROM(g_sys.ipcToDTC, 2);
        break;

    default:
        break;
    }

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_MACHINE_CONFIG);
    cmd->hdr.index  = 0;
    cmd->hdr.status = (uint16_t)rc;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return 0;
}


uint16_t HandleMachineConfigGet(int fd, STC_COMMAND_MACHINE_CONFIG_GET* cmd)
{
    int rc = IPC_ERR_SUCCESS;

    /* Gets the STC and DTC configuration parameters struct in memory */
    memset(&(cmd->stc), 0, sizeof(STC_CONFIG_DATA));
    memset(&(cmd->dtc), 0, sizeof(DTC_CONFIG_DATA));

    /* Return global STC system config data in the message buffer */
    memcpy(&(cmd->stc), &g_sys.cfgSTC, sizeof(STC_CONFIG_DATA));

    /* Get the DTC config data via IPC from DTC */
    rc = IPCToDTC_ConfigGet(g_sys.ipcToDTC, &cmd->dtc);

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_MACHINE_CONFIG_GET);
    cmd->hdr.index  = 0;
    cmd->hdr.status = (uint16_t)rc;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return rc;
}


uint16_t HandleMachineConfigSet(int fd, STC_COMMAND_MACHINE_CONFIG_SET* cmd)
{
    int rc = IPC_ERR_SUCCESS;

    /* Copy STC config data into the STC config buffer */
    memcpy(&g_sys.cfgSTC, &(cmd->stc), sizeof(STC_CONFIG_DATA));

    /* Send the DTC new config data via IPC */
    rc = IPCToDTC_ConfigSet(g_sys.ipcToDTC, &cmd->dtc);

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_HDR) + sizeof(STC_COMMAND_ARG);
    cmd->hdr.index  = 0;
    cmd->hdr.status = (uint16_t)rc;

    /* Reply Message Data */
    cmd->arg.param1.U = 0;
    cmd->arg.param2.U = 0;
    cmd->arg.bitflags = 0;

    return rc;
}


uint16_t HandleRTCTimeDateGet(int fd, STC_COMMAND_RTC_TIMEDATE_GET* cmd)
{
    uint16_t status = 0;
    RTCC_Struct ts;

    /* Read the current RTC time/date */

    if (RTC_GetDateTime(&ts))
    {
        /* Fill in the return members */
        cmd->datetime.sec     = ts.sec;         /* seconds 0-59      */
        cmd->datetime.min     = ts.min;         /* minutes 0-59      */
        cmd->datetime.hour    = ts.hour;        /* 24-hour 0-23      */
        cmd->datetime.weekday = ts.weekday;     /* weekday 1-7       */
        cmd->datetime.date    = ts.date;        /* day of month 0-30 */
        cmd->datetime.month   = ts.month;       /* month 0-11        */
        cmd->datetime.year    = ts.year;        /* year 0-128 (+2000)*/
    }
    else
    {
        /* Error reading time/date */
        status = 1;
    }

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_RTC_TIMEDATE_GET);
    cmd->hdr.index  = 0;
    cmd->hdr.status = status;

    return status;
}


uint16_t HandleRTCTimeDateSet(int fd, STC_COMMAND_RTC_TIMEDATE_SET* cmd)
{
    uint16_t status = 0;
    RTCC_Struct ts;

    /* Fill in time/date with values received */

    ts.sec     = cmd->datetime.sec;         /* seconds 0-59      */
    ts.min     = cmd->datetime.min;         /* minutes 0-59      */
    ts.hour    = cmd->datetime.hour;        /* 24-hour 0-23      */
    ts.weekday = cmd->datetime.weekday;     /* weekday 1-7       */
    ts.date    = cmd->datetime.date;        /* day of month 0-30 */
    ts.month   = cmd->datetime.month;       /* month 0-11        */
    ts.year    = cmd->datetime.year;        /* year 0-128 (+2000)*/

    /* Check that the time/date parameters are all valid */
    if (RTC_IsValidTime(&ts))
    {
        /* Attempt to set the RTC time/date */
        if (!RTC_SetDateTime(&ts))
        {
            /* Error setting time/date */
            status = 1;
        }
    }
    else
    {
        /* Invalid time or date */
        status = 2;
    }

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_RTC_TIMEDATE_SET);
    cmd->hdr.index  = 0;
    cmd->hdr.status = status;

    return status;
}


uint16_t HandleMACAddrGet(int fd, STC_COMMAND_MACADDR_GET* cmd)
{
    uint16_t status = 0;

    /* Copy the MAC address */
    memcpy(&(cmd->macaddr), &g_sys.ui8MAC, 6);

    /* Copy the STC serial number */
    memcpy(&(cmd->sernum_stc), &g_sys.ui8SerialNumberSTC, 16);

    /* Copy the DTC serial number*/
    memcpy(&(cmd->sernum_dtc), &g_sys.ui8SerialNumberDTC, 16);

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_MACADDR_GET);
    cmd->hdr.index  = 0;
    cmd->hdr.status = status;

    return status;
}


uint16_t HandleSMPTEEncoderCtrl(int fd, STC_COMMAND_SMPTE_ENCODER_CTRL* cmd)
{
    uint16_t status = 0;
    bool reset = false;

    if (!g_sys.smpteFound)
    {
        status = 0xFFFF;
    }
    else
    {
        switch(cmd->ctrl & 0xFF)
        {
        case STC_SMPTE_ENCODER_CTRL_STOP:
            /* Stop the SMPTE generator */
            SMPTE_encoder_stop();
            break;

        case STC_SMPTE_ENCODER_CTRL_START:
            /* Check if we need to reset the time first */
            if (cmd->flags & STC_ENCODER_CTRL_F_RESET)
                reset = true;
            /* Start generator at time zero */
            SMPTE_encoder_start(reset);
            break;

        default:
            status = 0xFFFF;
            break;
        }
    }

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_SMPTE_ENCODER_CTRL);
    cmd->hdr.index  = 0;
    cmd->hdr.status = status;

    return status;
}


uint16_t HandleSMPTETimeSet(int fd, STC_COMMAND_SMPTE_TIME_SET* cmd)
{
    uint16_t status = 0;

    SMPTE_encoder_set_time(cmd->hours, cmd->mins, cmd->secs, cmd->frame);

    /* Reply Header Data */
    cmd->hdr.length = sizeof(STC_COMMAND_SMPTE_TIME_SET);
    cmd->hdr.index  = 0;
    cmd->hdr.status = status;

    return status;
}

// End-Of-File
